app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.activate_user.paginate page: params[:page]

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new user_params
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 624080055], ["LIMIT", 1]]
---
  def find_user
    @user = User.find_by id: params[:id]