app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_user
    @user = User.find_by id: params[:id]